raceup-electric/stm32h5_template_drivers/adc.cpp
void set_dma_owner(ADC_TypeDef* const p_instance, opaque_adc* const p_owner) noexcept {
  if (p_instance != nullptr) {
    dma_owner_slot(p_instance) = p_owner;
  }
}

bool dma_initialized(const opaque_adc& config) noexcept {
  return config.m_handle.Instance != nullptr && config.m_dma_channel_handle.Instance != nullptr;
}

opaque_adc* running_dma_owner_for(const opaque_adc& config) noexcept {
  if (!config.uses_dma()) {
    return nullptr;
  }

  auto* const owner = dma_owner_for_instance(config.instance());
  if (owner == nullptr || !dma_initialized(*owner)) {
    return nullptr;
  }

  return owner;
}

opaque_adc* running_injected_owner_for(const opaque_adc& config) noexcept {
  if (!config.uses_injected()) {
    return nullptr;
  }

  auto* const owner = dma_owner_for_instance(config.instance());
  if (owner == nullptr || !dma_initialized(*owner)) {
    return nullptr;
  }

  return owner;
}

opaque_adc* adc_from_handle(ADC_HandleTypeDef* const hadc) noexcept {
  return hadc != nullptr ? dma_owner_for_instance(hadc->Instance) : nullptr;
}

dma_shared_state& dma_state(opaque_adc& runtime) noexcept {
  return dma_state_slot(runtime.instance());
}

void accumulate_dma_samples(opaque_adc& runtime, const std::size_t begin_sample,
                            const std::size_t end_sample) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  if (active_buffer_length == 0U) {
    (void)begin_sample;
    (void)end_sample;
    return;
  }

  const std::size_t begin = std::min(begin_sample, active_buffer_length);
  const std::size_t end = std::min(end_sample, active_buffer_length);
  const auto sequence_length = dma_sequence_length(runtime);
  auto& state = dma_state(runtime);
  auto* const buffer = dma_buffer(runtime);

  for (std::size_t sample = begin; sample < end; ++sample) {
    const auto channel_index = sample % sequence_length;
    state.average_sums[channel_index] += buffer[sample];
    state.average_sample_counts[channel_index] += 1U;
  }
}

void accumulate_dma_until(opaque_adc& runtime, const std::size_t boundary) noexcept {
  auto& state = dma_state(runtime);
  if (boundary <= state.processed_samples_in_cycle) {
    return;
  }

  accumulate_dma_samples(runtime, state.processed_samples_in_cycle, boundary);
  state.processed_samples_in_cycle = boundary;
}

uint32_t dma_channel_mask(const std::size_t channel_index) noexcept {
  return 1UL << channel_index;
}

void sum_fixed_dma_window(
    const opaque_adc& runtime,
    const std::size_t end_sample,
    std::array<uint64_t, kAdcDmaMaxSequenceLength>& sums,
    std::array<uint32_t, kAdcDmaMaxSequenceLength>& counts) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto window_width = dma_window_width(runtime);
  const auto sequence_length = dma_sequence_length(runtime);
  auto* const buffer = dma_buffer(runtime);
  if (active_buffer_length == 0U || sequence_length == 0U || buffer == nullptr) {
    return;
  }

  for (std::size_t offset = 0U; offset < window_width; ++offset) {
    const auto sample =
        (end_sample + active_buffer_length - window_width + offset) %
        active_buffer_length;
    const auto channel_index = sample % sequence_length;
    sums[channel_index] += buffer[sample];
    counts[channel_index] += 1U;
  }
}

void complete_fixed_dma_window(opaque_adc& runtime,
                               const std::size_t boundary) noexcept {
  const auto active_buffer_length = dma_transfer_length(runtime);
  auto& state = dma_state(runtime);
  if (active_buffer_length == 0U || boundary > active_buffer_length ||
      boundary <= state.processed_samples_in_cycle) {
    return;
  }

  const auto window_width = dma_window_width(runtime);
  const auto completed_count = boundary - state.processed_samples_in_cycle;
  const auto valid_count =
      std::min(window_width, state.fixed_window_sample_count + completed_count);

  state.processed_samples_in_cycle = boundary;
  state.fixed_window_sample_count = valid_count;
  if (valid_count < window_width) {
    return;
  }

  std::array<uint64_t, kAdcDmaMaxSequenceLength> sums{};
  std::array<uint32_t, kAdcDmaMaxSequenceLength> counts{};
  sum_fixed_dma_window(runtime, boundary, sums, counts);

  const auto sequence_length = dma_sequence_length(runtime);
  uint32_t valid_channels{0U};
  for (std::size_t channel_index = 0U; channel_index < sequence_length;
       ++channel_index) {
    const auto count = counts[channel_index];
    if (count == 0U) {
      continue;
    }

    state.fixed_window_values[channel_index] =
        static_cast<uint16_t>(sums[channel_index] / count);
    valid_channels |= dma_channel_mask(channel_index);
  }

  state.fixed_window_valid_channels = valid_channels;
}

bool prepare_dma_runtime(opaque_adc& runtime) noexcept {
  auto& state = dma_state(runtime);
  state.average_sums.fill(0U);
  state.average_sample_counts.fill(0U);
  state.fixed_window_values.fill(0U);
  state.fixed_window_valid_channels = 0U;
  state.fixed_window_sample_count = 0U;
  state.processed_samples_in_cycle = 0U;
  const auto active_buffer_length = dma_transfer_length(runtime);
  const auto sequence_length = dma_sequence_length(runtime);
  const auto window_width = dma_window_width(runtime);
  const bool sequence_ok =
      sequence_length > 0U && sequence_length <= kAdcDmaMaxSequenceLength;
  const bool window_ok =
      window_width > 0U && window_width <= active_buffer_length;
  const bool fixed_window_ok =
      !uses_fixed_window_average(runtime) ||
      (sequence_ok && window_ok &&
       (active_buffer_length % sequence_length) == 0U &&
       (window_width % sequence_length) == 0U);
  return dma_buffer(runtime) != nullptr &&
         active_buffer_length <= dma_buffer_size_for(runtime.m_p_config) &&
         sequence_ok && window_ok && fixed_window_ok;
}

bool configure_adc_channels(opaque_adc& runtime) noexcept {
  const auto sequence_length = dma_sequence_length(runtime);
  if (sequence_length == 1U) {
    auto channel_config = runtime.channel_init();
    channel_config.Rank = ADC_REGULAR_RANK_1;
    return HAL_ADC_ConfigChannel(&runtime.m_handle, &channel_config) == HAL_OK;
  }

  const auto* const channel_sequence = runtime.dma_channel_sequence();
  if (channel_sequence == nullptr) {
    return false;
  }

