raceup-electric/stm32h5_template_drivers/adc.cpp
  for (std::size_t index = 0U; index < sequence_length; ++index) {
    auto channel_config = channel_sequence[index];
    if (HAL_ADC_ConfigChannel(&runtime.m_handle, &channel_config) != HAL_OK) {
      return false;
    }
  }

  return true;
}

bool configure_injected_channels(opaque_adc& runtime) noexcept {
#define RU_STM32H5XX_ADC_CONFIGURE_INJECTED(name, config)                         \
  if (config.uses_injected && config.instance() == runtime.instance()) {           \
    init_pin(config.port(), config.pin_init);                                      \
    auto injected_channel_config = config.injected_channel_init;                   \
    if (HAL_ADCEx_InjectedConfigChannel(                                           \
            &runtime.m_handle, &injected_channel_config) != HAL_OK) {              \
      return false;                                                                \
    }                                                                              \
  }
  RU_STM32H5XX_ADC_MAP(RU_STM32H5XX_ADC_CONFIGURE_INJECTED)
#undef RU_STM32H5XX_ADC_CONFIGURE_INJECTED
  return true;
}

bool init_trigger_timer(opaque_adc& runtime) noexcept {
  enable_tim_clock(runtime.trigger_timer_instance());

  auto& timer_handle = runtime.m_trigger_timer_handle;
  timer_handle = {};
  timer_handle.Instance = runtime.trigger_timer_instance();
  timer_handle.Init = runtime.trigger_timer_init();
  timer_handle.Init.Prescaler =
      timer_prescaler(runtime.trigger_timer_instance(), runtime.trigger_counter_clock_hz());
  timer_handle.Init.Period =
      timer_period(runtime.trigger_counter_clock_hz(), runtime.trigger_frequency_hz());

  if (HAL_TIM_Base_Init(&timer_handle) != HAL_OK) {
    timer_handle.Instance = nullptr;
    return false;
  }

  auto master_config = runtime.trigger_master_config();
  if (HAL_TIMEx_MasterConfigSynchronization(&timer_handle, &master_config) != HAL_OK) {
    (void)HAL_TIM_Base_DeInit(&timer_handle);
    timer_handle.Instance = nullptr;
    return false;
  }

  __HAL_TIM_SET_COUNTER(&timer_handle, 0U);
  return true;
}

bool start_trigger_timer(opaque_adc& runtime) noexcept {
  auto& timer_handle = runtime.m_trigger_timer_handle;
  if (timer_handle.Instance == nullptr) {
    return true;
  }

  return HAL_TIM_Base_Start(&timer_handle) == HAL_OK;
}

bool start_dma_backend_impl(opaque_adc& runtime) noexcept {
  if (!runtime.uses_dma()) {
    return false;
  }

  auto* const active_owner = dma_owner_for_instance(runtime.instance());
  if (active_owner != nullptr && active_owner != &runtime) {
    return false;
  }

  if (dma_initialized(runtime)) {
    return true;
  }

  const auto* const config = runtime.m_p_config;
  runtime = make_opaque(config);
  set_dma_owner(runtime.instance(), &runtime);

  const auto fail = [&runtime, config]() noexcept {
    set_dma_owner(runtime.instance(), nullptr);
    runtime = make_opaque(config);
    return false;
  };

  __HAL_RCC_ADC_CLK_ENABLE();
  __HAL_RCC_GPDMA1_CLK_ENABLE();

  if (!prepare_dma_runtime(runtime)) {
    return fail();
  }

  if (runtime.uses_timer_trigger() && !init_trigger_timer(runtime)) {
    return fail();
  }

  DMA_NodeConfTypeDef node_config{};
  node_config.NodeType = DMA_GPDMA_LINEAR_NODE;
  node_config.Init.Request = runtime.dma_request();
  node_config.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
  node_config.Init.Direction = DMA_PERIPH_TO_MEMORY;
  node_config.Init.SrcInc = DMA_SINC_FIXED;
  node_config.Init.DestInc = DMA_DINC_INCREMENTED;
  node_config.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_HALFWORD;
  node_config.Init.DestDataWidth = DMA_DEST_DATAWIDTH_HALFWORD;
  node_config.Init.SrcBurstLength = 1U;
  node_config.Init.DestBurstLength = 1U;
  node_config.Init.TransferAllocatedPort =
      DMA_SRC_ALLOCATED_PORT0 | DMA_DEST_ALLOCATED_PORT0;
  node_config.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  node_config.Init.Mode = DMA_NORMAL;
  node_config.TriggerConfig.TriggerPolarity = DMA_TRIG_POLARITY_MASKED;
  node_config.DataHandlingConfig.DataExchange = DMA_EXCHANGE_NONE;
  node_config.DataHandlingConfig.DataAlignment = DMA_DATA_RIGHTALIGN_ZEROPADDED;

  if (HAL_DMAEx_List_BuildNode(&node_config, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_InsertNode(&runtime.m_dma_queue, nullptr, &runtime.m_dma_node) != HAL_OK ||
      HAL_DMAEx_List_SetCircularMode(&runtime.m_dma_queue) != HAL_OK) {
    return fail();
  }

  runtime.m_dma_channel_handle.Instance = runtime.dma_channel();
  runtime.m_dma_channel_handle.InitLinkedList.Priority = DMA_LOW_PRIORITY_LOW_WEIGHT;
  runtime.m_dma_channel_handle.InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
  runtime.m_dma_channel_handle.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
  runtime.m_dma_channel_handle.InitLinkedList.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
  runtime.m_dma_channel_handle.InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;

  if (HAL_DMAEx_List_Init(&runtime.m_dma_channel_handle) != HAL_OK ||
      HAL_DMAEx_List_LinkQ(&runtime.m_dma_channel_handle, &runtime.m_dma_queue) != HAL_OK ||
      HAL_DMA_ConfigChannelAttributes(&runtime.m_dma_channel_handle, DMA_CHANNEL_NPRIV) !=
          HAL_OK) {
    return fail();
  }

  HAL_NVIC_SetPriority(runtime.dma_irq(), 6U, 0U);
  HAL_NVIC_EnableIRQ(runtime.dma_irq());

  runtime.m_handle.Instance = runtime.instance();
  runtime.m_handle.Init = runtime.adc_init();
  __HAL_LINKDMA(&runtime.m_handle, DMA_Handle, runtime.m_dma_channel_handle);

  if (HAL_ADC_Init(&runtime.m_handle) != HAL_OK) {
    return fail();
  }

  if (!configure_adc_channels(runtime)) {
    return fail();
  }

  auto* const buffer = dma_buffer(runtime);
  std::fill_n(buffer, dma_transfer_length(runtime), 0U);

  if (HAL_ADCEx_Calibration_Start(&runtime.m_handle, ADC_SINGLE_ENDED) != HAL_OK) {
    return fail();
  }

  if (!configure_injected_channels(runtime)) {
    return fail();
  }

  if (HAL_ADC_Start_DMA(&runtime.m_handle,
                        reinterpret_cast<uint32_t*>(buffer),
                        static_cast<uint32_t>(dma_transfer_length(runtime))) != HAL_OK) {
    return fail();
  }

