raceup-electric/stm32h5_template_drivers/adc.cpp
  if (!start_trigger_timer(runtime)) {
    return fail();
  }

  return true;
}

uint32_t lock_irq() noexcept {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  return primask;
}

void unlock_irq(const uint32_t primask) noexcept {
  __set_PRIMASK(primask);
}

expected::expected<uint16_t, result> read_dma_average(const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.average_sums[channel_index];
  const uint32_t count = state.average_sample_counts[channel_index];
  state.average_sums[channel_index] = 0U;
  state.average_sample_counts[channel_index] = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return static_cast<uint16_t>(sum / count);
}

expected::expected<uint16_t, result> read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || !uses_fixed_window_average(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint16_t value = state.fixed_window_values[channel_index];
  const bool valid =
      (state.fixed_window_valid_channels & dma_channel_mask(channel_index)) != 0U;
  unlock_irq(primask);

  if (!valid) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  return value;
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint64_t sum = state.average_sums[channel_index];
  const uint32_t count = state.average_sample_counts[channel_index];
  state.average_sums[channel_index] = 0U;
  state.average_sample_counts[channel_index] = 0U;
  unlock_irq(primask);

  if (count == 0U) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{static_cast<uint16_t>(sum / count)};
}

expected::expected<std::optional<uint16_t>, result> try_read_dma_fixed_window_average(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_dma_owner_for(config);
  if (runtime == nullptr || !uses_fixed_window_average(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto channel_index = config.dma_sequence_index();
  if (channel_index >= dma_sequence_length(*runtime)) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  auto& state = dma_state(*runtime);
  const uint32_t primask = lock_irq();
  const uint16_t value = state.fixed_window_values[channel_index];
  const bool valid =
      (state.fixed_window_valid_channels & dma_channel_mask(channel_index)) != 0U;
  unlock_irq(primask);

  if (!valid) {
    return std::optional<uint16_t>{};
  }

  return std::optional<uint16_t>{value};
}

expected::expected<uint16_t, result> read_injected_conversion(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_injected_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  if (HAL_ADCEx_InjectedStart(&runtime->m_handle) != HAL_OK) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  if (HAL_ADCEx_InjectedPollForConversion(
          &runtime->m_handle, config.polling_timeout_ms()) != HAL_OK) {
    (void)HAL_ADCEx_InjectedStop(&runtime->m_handle);
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto value = static_cast<uint16_t>(
      HAL_ADCEx_InjectedGetValue(
          &runtime->m_handle, config.injected_channel_init().InjectedRank));
  (void)HAL_ADCEx_InjectedStop(&runtime->m_handle);
  return value;
}

expected::expected<std::optional<uint16_t>, result> try_read_injected_conversion(
    const opaque_adc& config) noexcept {
  auto* const runtime = running_injected_owner_for(config);
  if (runtime == nullptr) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  if (HAL_ADCEx_InjectedStart(&runtime->m_handle) != HAL_OK) {
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto poll_status =
      HAL_ADCEx_InjectedPollForConversion(&runtime->m_handle, 0U);
  if (poll_status == HAL_TIMEOUT) {
    (void)HAL_ADCEx_InjectedStop(&runtime->m_handle);
    return std::optional<uint16_t>{};
  }

  if (poll_status != HAL_OK) {
    (void)HAL_ADCEx_InjectedStop(&runtime->m_handle);
    return expected::unexpected(result::RECOVERABLE_ERROR);
  }

  const auto value = static_cast<uint16_t>(
      HAL_ADCEx_InjectedGetValue(
          &runtime->m_handle, config.injected_channel_init().InjectedRank));
  (void)HAL_ADCEx_InjectedStop(&runtime->m_handle);
  return std::optional<uint16_t>{value};
}
}  // namespace

void adc_dma_half_transfer_callback(ADC_HandleTypeDef* hadc) noexcept {
  auto* const runtime = adc_from_handle(hadc);
  if (runtime == nullptr) {
    return;
  }

  const auto half_buffer_length = dma_transfer_length(*runtime) / 2U;
  if (uses_fixed_window_average(*runtime)) {
    complete_fixed_dma_window(*runtime, half_buffer_length);
  } else {
    accumulate_dma_until(*runtime, half_buffer_length);
  }
}

