raceup-electric/stm32h5_template_drivers/adc.cpp
void adc_dma_full_transfer_callback(ADC_HandleTypeDef* hadc) noexcept {
  auto* const runtime = adc_from_handle(hadc);
  if (runtime == nullptr) {
    return;
  }

  if (uses_fixed_window_average(*runtime)) {
    complete_fixed_dma_window(*runtime, dma_transfer_length(*runtime));
  } else {
    accumulate_dma_until(*runtime, dma_transfer_length(*runtime));
  }
  dma_state(*runtime).processed_samples_in_cycle = 0U;
}

void adc_dma_irq_handler(ADC_TypeDef* const p_instance) noexcept {
  auto* const runtime = dma_owner_for_instance(p_instance);
  if (runtime == nullptr) {
    return;
  }

  HAL_DMA_IRQHandler(&runtime->m_dma_channel_handle);
}

bool opaque_adc::initialized() const noexcept {
  if (uses_dma()) {
    return running_dma_owner_for(*this) != nullptr;
  }

  if (uses_injected()) {
    return running_injected_owner_for(*this) != nullptr;
  }

  return m_handle.Instance != nullptr;
}

std::optional<AdcId> opaque_adc::id() const noexcept {
  for (std::size_t index = 0U; index < static_cast<std::size_t>(AdcId::COUNT); ++index) {
    const auto id = static_cast<AdcId>(index);
    if (config_for(id) == m_p_config) {
      return id;
    }
  }

  return std::nullopt;
}

bool opaque_adc::uses_dma() const noexcept {
  return m_p_config != nullptr && m_p_config->uses_dma;
}

bool opaque_adc::uses_injected() const noexcept {
  return m_p_config != nullptr && m_p_config->uses_injected;
}

ADC_TypeDef* opaque_adc::instance() const noexcept {
  return m_p_config != nullptr ? m_p_config->instance() : nullptr;
}

GPIO_TypeDef* opaque_adc::port() const noexcept {
  return m_p_config != nullptr ? m_p_config->port() : nullptr;
}

const GPIO_InitTypeDef& opaque_adc::pin_init() const noexcept {
  return m_p_config->pin_init;
}

const ADC_InitTypeDef& opaque_adc::adc_init() const noexcept {
  return m_p_config->init;
}

const ADC_ChannelConfTypeDef& opaque_adc::channel_init() const noexcept {
  return m_p_config->channel_init;
}

const ADC_InjectionConfTypeDef& opaque_adc::injected_channel_init() const noexcept {
  return m_p_config->injected_channel_init;
}

uint32_t opaque_adc::polling_timeout_ms() const noexcept {
  return m_p_config != nullptr ? m_p_config->polling_timeout_ms
                               : stm32h5xx::cfg::kDefaultAdcPollTimeoutMs;
}

uint16_t opaque_adc::sample_max() const noexcept {
  return m_p_config != nullptr ? m_p_config->sample_max
                               : stm32h5xx::cfg::kDefaultAdcSampleMax;
}

const ADC_ChannelConfTypeDef* opaque_adc::dma_channel_sequence() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_channel_sequence : nullptr;
}

std::size_t opaque_adc::dma_frame_count() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_frame_count : 0U;
}

std::size_t opaque_adc::dma_sequence_length() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_channel_sequence_length : 0U;
}

std::size_t opaque_adc::dma_sequence_index() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_sequence_index : 0U;
}

stm32h5xx::cfg::adc_dma_backend opaque_adc::dma_backend() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_backend
                               : stm32h5xx::cfg::adc_dma_backend::average_since_read;
}

std::size_t opaque_adc::dma_window_width() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_window_width : 0U;
}

uint32_t opaque_adc::dma_request() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_request : 0U;
}

DMA_Channel_TypeDef* opaque_adc::dma_channel() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_channel() : nullptr;
}

IRQn_Type opaque_adc::dma_irq() const noexcept {
  return m_p_config != nullptr ? m_p_config->dma_irq : static_cast<IRQn_Type>(0);
}

bool opaque_adc::uses_timer_trigger() const noexcept {
  return m_p_config != nullptr && m_p_config->uses_timer_trigger();
}

TIM_TypeDef* opaque_adc::trigger_timer_instance() const noexcept {
  return m_p_config != nullptr ? m_p_config->trigger_timer_instance() : nullptr;
}

uint32_t opaque_adc::trigger_counter_clock_hz() const noexcept {
  return m_p_config != nullptr ? m_p_config->trigger_counter_clock_hz : 0U;
}

uint32_t opaque_adc::trigger_frequency_hz() const noexcept {
  return m_p_config != nullptr ? m_p_config->trigger_frequency_hz : 0U;
}

const TIM_Base_InitTypeDef& opaque_adc::trigger_timer_init() const noexcept {
  return m_p_config->trigger_timer_init;
}

const TIM_MasterConfigTypeDef& opaque_adc::trigger_master_config() const noexcept {
  return m_p_config->trigger_master_config;
}

void opaque_adc::start() noexcept {
  __HAL_RCC_ADC_CLK_ENABLE();
}

result opaque_adc::init() noexcept {
  if (!valid()) {
    return result::UNRECOVERABLE_ERROR;
  }

  init_pin(port(), pin_init());

  if (uses_injected()) {
    return initialized() ? result::OK : result::RECOVERABLE_ERROR;
  }

  if (uses_dma()) {
    if (initialized()) {
      return result::OK;
    }

    return start_dma_backend_impl(*this) ? result::OK : result::RECOVERABLE_ERROR;
  }

  if (initialized()) {
    return result::OK;
  }

  m_handle.Instance = instance();
  m_handle.Init = adc_init();

  if (HAL_ADC_Init(&m_handle) != HAL_OK) {
    m_handle.Instance = nullptr;
    return result::RECOVERABLE_ERROR;
  }

  auto channel = channel_init();

  return from_hal_status(HAL_ADC_ConfigChannel(&m_handle, &channel));
}

result opaque_adc::stop() noexcept {
  if (uses_dma()) {
    if (!dma_initialized(*this)) {
      return result::OK;
    }

    result status = result::OK;
    if (m_trigger_timer_handle.Instance != nullptr) {
      if (HAL_TIM_Base_Stop(&m_trigger_timer_handle) != HAL_OK ||
          HAL_TIM_Base_DeInit(&m_trigger_timer_handle) != HAL_OK) {
        status = result::RECOVERABLE_ERROR;
      }
    }

    if (HAL_ADC_Stop_DMA(&m_handle) != HAL_OK || HAL_ADC_DeInit(&m_handle) != HAL_OK) {
      status = result::RECOVERABLE_ERROR;
    }

    set_dma_owner(instance(), nullptr);
    const auto* const config = m_p_config;
    *this = make_opaque(config);
    return status;
  }

  if (uses_injected()) {
    return result::OK;
  }

  (void)HAL_ADC_Stop(&m_handle);
  const auto status = from_hal_status(HAL_ADC_DeInit(&m_handle));
  if (status == result::OK) {
    m_handle.Instance = nullptr;
  }
  return status;
}

