raceup-electric/stm32h5_template_drivers/adc.cpp
result opaque_adc::read(uint16_t& r_value) noexcept {
  if (uses_dma()) {
    const auto dma_value = uses_fixed_window_average(*this)
                               ? read_dma_fixed_window_average(*this)
                               : read_dma_average(*this);
    if (!dma_value.has_value()) {
      return dma_value.error();
    }

    r_value = *dma_value;
    return result::OK;
  }

  if (uses_injected()) {
    const auto injected_value = read_injected_conversion(*this);
    if (!injected_value.has_value()) {
      return injected_value.error();
    }

    r_value = *injected_value;
    return result::OK;
  }

  if (HAL_ADC_Start(&m_handle) != HAL_OK) {
    return result::RECOVERABLE_ERROR;
  }

  if (HAL_ADC_PollForConversion(&m_handle, polling_timeout_ms()) != HAL_OK) {
    (void)HAL_ADC_Stop(&m_handle);
    return result::RECOVERABLE_ERROR;
  }

  r_value = static_cast<uint16_t>(HAL_ADC_GetValue(&m_handle));
  (void)HAL_ADC_Stop(&m_handle);
  return result::OK;
}

result opaque_adc::try_read(bool& r_has_value, uint16_t& r_value) noexcept {
  r_has_value = false;
  if (uses_dma()) {
    const auto dma_value = uses_fixed_window_average(*this)
                               ? try_read_dma_fixed_window_average(*this)
                               : try_read_dma_average(*this);
    if (!dma_value.has_value()) {
      return dma_value.error();
    }

    if (!dma_value->has_value()) {
      return result::OK;
    }

    r_has_value = true;
    r_value = **dma_value;
    return result::OK;
  }

  if (uses_injected()) {
    const auto injected_value = try_read_injected_conversion(*this);
    if (!injected_value.has_value()) {
      return injected_value.error();
    }

    if (!injected_value->has_value()) {
      return result::OK;
    }

    r_has_value = true;
    r_value = **injected_value;
    return result::OK;
  }

  if (HAL_ADC_Start(&m_handle) != HAL_OK) {
    return result::RECOVERABLE_ERROR;
  }

  const auto poll_status = HAL_ADC_PollForConversion(&m_handle, 0U);
  if (poll_status == HAL_TIMEOUT) {
    (void)HAL_ADC_Stop(&m_handle);
    return result::OK;
  }

  if (poll_status != HAL_OK) {
    (void)HAL_ADC_Stop(&m_handle);
    return result::RECOVERABLE_ERROR;
  }

  r_has_value = true;
  r_value = static_cast<uint16_t>(HAL_ADC_GetValue(&m_handle));
  (void)HAL_ADC_Stop(&m_handle);
  return result::OK;
}
}  // namespace ru::driver

extern "C" void HAL_ADC_ConvHalfCpltCallback(ADC_HandleTypeDef* hadc) {
  ru::driver::adc_dma_half_transfer_callback(hadc);
}

extern "C" void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc) {
  ru::driver::adc_dma_full_transfer_callback(hadc);
}

extern "C" void GPDMA1_Channel0_IRQHandler(void) {
  ru::driver::adc_dma_irq_handler(ADC1);
}

extern "C" void GPDMA1_Channel1_IRQHandler(void) {
  ru::driver::adc_dma_irq_handler(ADC2);
}
